Revit 2026 API

# ParameterFilterUtilitiesIsParameterApplicable Method

---

Used to determine whether the element supports the given parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsParameterApplicable(
	Element element,
	ElementId parameter
)
```
```vb
Public Shared Function IsParameterApplicable (
	element As Element,
	parameter As ElementId
) As Boolean
```
```cpp
public:
static bool IsParameterApplicable(
	Element^ element,
	ElementId^ parameter
)
```
```fsharp
static member IsParameterApplicable :
        element : Element *
        parameter : ElementId -> bool
```

#### Parameters

element Element
     The element to query for support of the given parameter.
parameter ElementId
     The parameter for which to query support.

#### Return Value

Boolean True if the element supports the given parameter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This operation is supported for external (e.g., shared, project) parameters only.

#### Reference

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace